Updated the iterator pattern page to use mermaid diagrams
